<template>
    <div class="container-fluid mt-5">
        <div class="row mb-6" v-for="(advantage, index) in advantages" :key="index">
            <div class="col-md-6 p-0" :class="{'order-md-2': index % 2 !== 0}">
                <div class="image-container">
                    <img :src="advantage.image" class="img-fluid" alt="advantage image">
                </div>
            </div>

            <div class="col-md-6 d-flex align-items-start p-4" :class="{'order-md-1': index % 2 !== 0}">
                <div>
                    <h3 class="display-5">{{ advantage.title }}</h3>
                    <p class="lead">{{ advantage.description }}</p>
                </div>
            </div>
        </div>
    </div>
</template>

<script>
export default {
    name: 'Advantages',
    data() {
        return {
            advantages: [
                {
                    title: 'Опытные инструкторы',
                    description: 'Наши инструкторы имеют многолетний опыт работы в области обучения вождению и проходят регулярные курсы повышения квалификации, чтобы оставаться в курсе новых правил дорожного движения и технологий. Каждый из них является сертифицированным специалистом, способным обучать как начинающих водителей, так и тех, кто хочет улучшить свои навыки. Мы понимаем, что каждому студенту нужен индивидуальный подход, и наши инструкторы готовы адаптировать методику обучения к уникальным потребностям и стилю обучения каждого ученика. Они не только учат навыкам вождения, но и обеспечивают поддерживающую и комфортную атмосферу, где студенты могут задавать вопросы и обсуждать свои страхи и сомнения',
                    image: '/images/advantages/advantage-1-voditel.jpg'
                },
                {
                    title: 'Современное оборудование',
                    description: 'Автошкола "Политех" предлагает своим ученикам обучение на современных автомобилях, оборудованных всем необходимым для комфортного и безопасного вождения. Мы гордимся нашим автопарком, который состоит из новейших моделей, включая как малые, так и большие автомобили, чтобы студенты могли выбрать транспортное средство, соответствующее их предпочтениям и целям. Каждое транспортное средство регулярно проходит техническое обслуживание и проверку, чтобы гарантировать максимальную безопасность во время занятий. Кроме того, на каждом автомобиле установлены системы контроля, позволяющие инструкторам отслеживать поведение ученика за рулем и давать обратную связь в реальном времени. Мы обновляем наш автопарк каждый год, чтобы обеспечить лучший опыт для наших студентов и подготовить их к реальным условиям дорожного движения',
                    image: '/images/advantages/advantage-2-car.jpg'
                },
                {
                    title: 'Гибкий график обучения',
                    description: 'Мы понимаем, что у каждого студента свой ритм жизни и свои обязательства, поэтому предлагаем гибкий график занятий, который позволяет каждому ученику находить оптимальное время для обучения. Вы можете выбрать удобное время для уроков, включая вечерние и выходные дни, чтобы сделать процесс обучения максимально комфортным. Наша цель — сделать обучение доступным для всех, независимо от их занятости или семейных обязательств. Кроме того, мы предлагаем возможность онлайн-записи на занятия, что упрощает планирование и организацию обучения. У нас также есть возможность переноса занятий в случае, если у вас возникли непредвиденные обстоятельства, что делает наше обучение ещё более удобным и доступным для всех',
                    image: '/images/advantages/advantage-3-class.jpeg'
                },
            ],
        };
    },
};
</script>

<style scoped>
/* Контейнер изображения */
.image-container {
    height: 100%; /* Полная высота контейнера */
    width: 100%; /* Ширина контейнера 100% */
    overflow: hidden; /* Скрытие частей изображения, выходящих за рамки контейнера */
    display: flex;
    align-items: center;
    justify-content: center;
}

.image-container img {
    height: 100%; /* Изображение занимает всю высоту контейнера */
    width: 100%; /* Изображение растягивается на всю ширину контейнера */
    object-fit: cover; /* Обрезка изображения, если оно выходит за пределы пропорций */
}

/* Колонка с текстом */
.col-md-7 {
    display: flex;
    flex-direction: column;
    justify-content: center;
    height: 400px; /* Устанавливаем ту же высоту, что и у изображения */
    padding: 20px; /* Добавляем отступы для текста */
}

.col-md-5, .col-md-7 {
    margin: 0; /* Убираем все внешние отступы */
    padding: 0; /* Убираем внутренние отступы у колонок */
}
</style>
